03_A02_Dummy_MRF_compressible/constant/ReadMe.txt
Simulation mit OF_matchingPeriodicityCoarse_3 läuft durch mit SRFSimpleFoam