03_A02_Dummy_MRF_compressible/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(HUB|SHROUD|BLADE)"
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    "(PER_1|PER_2)"
    {
        type            cyclicAMI;   
    }

    INLET
    {
        type            calculated;
        value           uniform 0;    
    }
	
    OUTLET
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //