03_A02_Dummy_MRF_compressible/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    "(HUB|SHROUD|BLADE)"
    {

		//High Re
        	type            nutUWallFunction; //nutUSpaldingWallFunction;//nutUSpaldingWallFunction;         
        	value           uniform 0;
    }

    "(PER_1|PER_2)"
    {
        type            cyclicAMI;   
    }

    INLET
    {
        type            calculated;
        value           $internalField;
    }
	
    OUTLET
    {
        type            calculated;
        value           $internalField;

    }



}


// ************************************************************************* //
